{
  "18.10.060.A": {
  "text": "Maximum sound levels: No person shall operate any equipment or appurtenances thereto in 
    commercial construction activities which exceeds 85 dBA, when measured at 50 feet (15.2 meters)
    from the source.  This standard shall not apply to trucks (see Section 18.10.020), pile drivers, 
    pavement breakers, scrapers, concrete saws and rock drills.",

  "requirements":{
    "value": {"maximum": 85},
    "units": "dBA",
    "source": {"excludes": ["trucks",
                            "pile drivers", 
                            "pavement breakers", 
                            "scrapers", 
                            "concrete saws", 
                            "rock drills"]},

  }
  },
  "18.10.060.B": {
    "text": "Night, weekend, and legal holidays limitation: From 6:00 p.m. to 7:00 a.m. the following 
      morning, and 6:00 p.m. Saturday to 7:00 a.m. the following Monday, and on legal holidays, the 
      permissible sound levels of Section 18.10.010 shall apply to all construction activities except 
      by variance or for reasons of emergency.  The exempted equipment of Section 18.10.060 A is not 
      exempted during these hours.  For purposes of this Subsection, construction activities on a 
      public road within a zone shall be considered as taking place on private property within that 
      zone.",
    "requirements":{
      "excludes": [
        
        {"value": {"minimum": "18:00",
                   "maximum": "07:00"},
         "units": "time",
         "when": "daily",
         "source": "all" },
        {"value": {"minimum": "07:00",
                   "maximum": "18:00"},
         "units": "time",
         "when": "Sunday",
         "source": "all"}
      ],
      "includes": {
        "value": {"minimum": "00:00",
                  "maximum": "24:00"},
        "units": "time",
        "when": "legal holidays",
        "source": "all",
        "refer_to_section": [{"section":"self","requires":[{"section":"18.10.010"}]}]
      }
    }
  },
  "18.10.060.C": {
    "text": "The adjustments to permissible sound levels established in Section 18.10.010 B apply to 
      Subsections A and B above.",
    "requirements":{
      "refer_to_section": [
        {"section":"18.10.060.A",
         "requires": [{"section": "18.10.010.B"}]},
        {"section":"18.10.060.B",
         "requires": [{"section": "18.10.010.B"}]}
      ]
    }
  },
  "18.10.060.D": {
    "text": "All equipment used in commercial activities shall have sound control devices no less   
      effective than those provided on the original equipment, and no equipment shall have an 
      unmuffled exhaust.",
    "requirements":{}
  },
  "18.10.060.E": {
    "text": "All equipment used in commercial construction activities shall comply with pertinent 
      standards of the U.S. Environmental Protection Agency.",
    "requirements":{}
  },

//F.  Pile Drivers:

  "18.10.060.F.1": {
    "text": "Notwithstanding Subsection B above, the permissible sound levels of Section 18.10.010 
      shall apply to pile drivers from 6 p.m. to 8 a.m. the following morning, and 6 p.m. Friday 
      to 8 a.m. the following Monday, and on legal holidays.",
    "requirements":{}
  },
  "18.10.060.F.2": {
    "text": "The owner of a site on which pile driving will occur shall cause a notice to be mailed to 
      all residences within 500 feet of the site.  Mailing will occur no fewer than 30 days prior to 
      the commencement of pile driving.  The notice shall list the expected starting and ending dates 
      for pile driving and give a telephone number for further information.",
    "requirements":{}
  }
}